module.exports = {
  "mainIdea": ["提升玩家挖掘速度和采集效率，节省生存前期、建筑党游戏时间"],
  "design": [{
    "title": "添加了三个可自定义的键位，按住以开启效果。分别是连锁挖掘、前向3x3挖掘模式、前向5x5挖掘模式",
  }, {
    "title": "连锁挖掘响应时运附魔",
  }, {
    "title": "掘地模式仅挖掘自然方块",
  }],
  "updates": [{
    "date": "2022-02-11",
    "content": [
      "本次更新为正式版，版本号定为1.0.0",
      "新增了掘地模式及其绑定按键",
      "修复了多人游戏主机才能触发连锁的问题",
      "修复了门这个大类的连锁挖掘时掉落数量错误的问题",
      "修复了藤蔓连锁不掉落的的问题",
      "现在创造模式下连锁挖掘将不会掉落任何物品"
    ]
  }, {
    "date": "2022-02-19",
    "content": [
      "现在无论哪种挖掘模式，完成一次操作都要消耗工具应该消耗的耐久度点数了（响应耐久附魔）",
    ]
  }, {
    "date": "2022-03-10",
    "content": [
      "版本号为v1.0.1，修复了使用该物品挖掘之后无法正常堆叠的问题",
    ]
  }, {
    "date": "2022-05-01",
    "content": [
      "已向上适配至1.18.1",
    ]
  }, {
    "date": "2022-05-12",
    "content": [
      "版本号为v1.1.0",
      "更新了算法，分离了共用代码",
      "将模组分为了<服务器端>和<客户端>两种模式供服主切换",
    ]
  }, {
    "date": "2023-03-31",
    "content": [
      "版本号1.2.0",
      "解决了因算法执行覆盖导致的无法“一键砍树”的问题",
      "向上适配至1.19.2",
    ]
  }, {
    "date": "2025-10-02",
    "content": [
      "版本号2.0.0",
      "彻底更换了底层逻辑代码和使用方法",
      "向上适配至1.21",
    ]
  }]
}