module.exports = {
  "mainIdea": ["节省玩家砍树花费的时间"],
  "design": [{
      "title": "触发条件与时机",
      "desc": [
        "当玩家手持斧头，并且处于潜行状态时(默认为按住shift键)",
        "当玩家破坏的当前方块是一个原木方块",
        "当玩家破坏的原木方块所处的结构被判定为一棵树/一株大型蘑菇/下界菌类"
      ]
    },
    {
      "title": "发动砍树效果后的计算过程",
      "desc": [
        "以第一格你破坏掉的方块为基准，检测其周围3x3x3范围内的所有合法树干方块（该种树原木/蘑菇柄/下界菌柄）并记录",
        "根据树干点位计算其周围半径为 R 的正方体范围内所有的该树木对应的树叶方块（该种树树叶方块/对应的蘑菇方块/下届疣块）并记录",
        "保留根部点位",
        "剔除掉叶子方块点位中3x3x3范围内有同种类原木且该原木不在 allLogs 记录当中的叶子点位（保留并视为邻近的另一棵树的一部分）",
        "将记录得到的方块一次全部挖掘掉"
      ]
    }
  ],
  "faq": [{
      "a": "什么时候程序会认为你砍的是一棵树/一株大型蘑菇/下界菌类",
      "an": "以你破坏的这格方块为基准，向下检测最多4格，如果除此类原木方块之外找到泥土或泥土亚种（草方块/泥土/砂土/灰化土/缠根泥土/菌丝），下届岩或其亚种（下届岩/绯红菌岩/诡异菌岩），则认为这是一棵树/一株大型蘑菇/下界菌类。",
    }, {
      "a": "什么是有效方块",
      "an": "就是指所有检测到的 1.与你第一个破坏掉的原木方块相同类型的，连续的原木方块 2.与你破坏掉的原木方块对应的叶子方块，且周边3x3x3范围内不能有同种类的未记录在册的原木方块"
    },
    {
      "a": "什么是连续的原木方块",
      "an": "3x3x3范围内能接连的就算是连续的"
    },
    {
      "a": "半径 R 的值",
      "ana": ["默认值为 4", "当砍伐的是丛林木时值为 6"]
    },
    {
      "a": "什么是“根部”",
      "an": "就是指所有记录在册的树干（原木/蘑菇柄/菌柄）点位中Y轴坐标小于你破坏的基准方块Y轴坐标值的所有方块"
    }
  ],
  "others": [
    "你可以对所有原版树木、大型蘑菇、下界菌类、以及所有符合 minecraft 命名规范的其他模组内的树木进行一键砍树",
    "在砍伐下界菌类时可以顺带将藏匿于其中的菌光体方块一起砍下来",
    "对菌类的砍伐有效方块判定方法稍有不同，你现在可以砍得比以前更齐整",
    "创造模式砍伐不会掉落任何物品",
    "使用了全新算法，引入了“这棵树”的概念，比以前砍的更齐整、更舒适"
  ],
  "updates": [{
    "date": "2022-02-11",
    "content": [
      "本次更新为正式版，版本号定为1.0.0",
      "更新了算法，不必要求当前方块的上方也是此类原木方块才会判定为一棵树",
      "现在你可以对大型蘑菇进行一键砍伐了",
      "现在你可以对下界菌类进行一键砍伐了，并且可以顺带将藏匿于其中的菌光体方块一起砍下来",
      "对菌类进行砍伐时，由于其奇特的构造，判定范围是 3x3x3，可有效一次性撸之。",
      "现在创造模式砍伐将不会掉落任何物品"
    ]
  }, {
    "date": "2022-04-30",
    "content": [
      "版本号1.1.0",
      "推翻了旧算法并采用全新算法，引入了“这棵树”的概念，比以前砍的更齐整，更舒适",
    ]
  }, {
    "date": "2022-05-20",
    "content": [
      "更新了1.18里面杜鹃树的砍法",
    ]
  }, {
    "date": "2023-03-29",
    "content": [
      "版本号1.2.0",
      "添加了1.19中红树的砍法",
      "向上适配至1.19.2",
      "向下兼容至1.12.2",
    ]
  }, {
    "date": "2025-09-11",
    "content": [
      "版本号1.3.0",
      "向上适配至1.21",
    ]
  }]
}