module.exports = {
  "mainIdea": ["提升玩家在生存时的冒险刺激感"],
  "design": [{
    "title": "当玩家手持发光物品时，在该玩家周围保持有光源存在，实现类似提灯的效果",
  }, {
    "title": "这里发光物品指的是火把、萤石块、南瓜灯、海晶灯、灯笼",
  }, {
    "title": "无论是主手持有还是副手持有均生效",
  }, {
    "title": "光源的亮度与火把被放置时的中心亮度一致",
  }, {
    "title": "从1.20.1起，发光物品添加了菌光体和三种蛙灯",
  }],
  "updates": [{
    "date": "---------",
    "content": [
      "更久远的历史已不可考",
    ]
  }, {
    "date": "2025-09-20",
    "content": [
      "版本号定为 2.0.0",
      "此版本为最新版，更换了核心技术，从完全事件监听式的增删方块，改为了事件监听式的添加方块搭配方块自带实体并启用刻自消除模式，运行起来更流畅更丝滑且无bug遗留",
    ]
  }]
}